""" from https://github.com/keithito/tacotron

Defines the set of symbols used in text input to the model.
"""
#_pad = "_"
#_punctuation = ';:,.!?¡¿—…"«»“” '
#_letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
#_letters_ipa = (
#    "ɑɐɒæɓʙβɔɕçɗɖðʤəɘɚɛɜɝɞɟʄɡɠɢʛɦɧħɥʜɨɪʝɭɬɫɮʟɱɯɰŋɳɲɴøɵɸθœɶʘɹɺɾɻʀʁɽʂʃʈʧʉʊʋⱱʌɣɤʍχʎʏʑʐʒʔʡʕʢǀǁǂǃˈˌːˑʼʴʰʱʲʷˠˤ˞↓↑→↗↘'̩'ᵻ"
#)

pmap = {'_': 0, '^': 1, '$': 2, ' ': 3, '!': 4, '"': 5, '(': 6, ')': 7,
',': 8, '-': 9, '.': 10, '...': 11, ':': 12, ';': 13, '?': 14, 'a0_I':
15, 'a0_S': 16, 'a0_B': 17, 'a0_E': 18, 'a1_I': 19, 'a1_S': 20, 'a1_B':
21, 'a1_E': 22, 'b_I': 23, 'b_S': 24, 'b_B': 25, 'b_E': 26, 'bj_I': 27,
'bj_S': 28, 'bj_B': 29, 'bj_E': 30, 'c_I': 31, 'c_S': 32, 'c_B': 33,
'c_E': 34, 'ch_I': 35, 'ch_S': 36, 'ch_B': 37, 'ch_E': 38, 'd_I': 39,
'd_S': 40, 'd_B': 41, 'd_E': 42, 'dj_I': 43, 'dj_S': 44, 'dj_B': 45,
'dj_E': 46, 'e0_I': 47, 'e0_S': 48, 'e0_B': 49, 'e0_E': 50, 'e1_I': 51,
'e1_S': 52, 'e1_B': 53, 'e1_E': 54, 'f_I': 55, 'f_S': 56, 'f_B': 57,
'f_E': 58, 'fj_I': 59, 'fj_S': 60, 'fj_B': 61, 'fj_E': 62, 'g_I': 63,
'g_S': 64, 'g_B': 65, 'g_E': 66, 'gj_I': 67, 'gj_S': 68, 'gj_B': 69,
'gj_E': 70, 'h_I': 71, 'h_S': 72, 'h_B': 73, 'h_E': 74, 'hj_I': 75,
'hj_S': 76, 'hj_B': 77, 'hj_E': 78, 'i0_I': 79, 'i0_S': 80, 'i0_B': 81,
'i0_E': 82, 'i1_I': 83, 'i1_S': 84, 'i1_B': 85, 'i1_E': 86, 'j_I': 87,
'j_S': 88, 'j_B': 89, 'j_E': 90, 'k_I': 91, 'k_S': 92, 'k_B': 93, 'k_E':
94, 'kj_I': 95, 'kj_S': 96, 'kj_B': 97, 'kj_E': 98, 'l_I': 99, 'l_S':
100, 'l_B': 101, 'l_E': 102, 'lj_I': 103, 'lj_S': 104, 'lj_B': 105,
'lj_E': 106, 'm_I': 107, 'm_S': 108, 'm_B': 109, 'm_E': 110, 'mj_I': 111,
'mj_S': 112, 'mj_B': 113, 'mj_E': 114, 'n_I': 115, 'n_S': 116, 'n_B':
117, 'n_E': 118, 'nj_I': 119, 'nj_S': 120, 'nj_B': 121, 'nj_E': 122,
'o0_I': 123, 'o0_S': 124, 'o0_B': 125, 'o0_E': 126, 'o1_I': 127, 'o1_S':
128, 'o1_B': 129, 'o1_E': 130, 'p_I': 131, 'p_S': 132, 'p_B': 133, 'p_E':
134, 'pj_I': 135, 'pj_S': 136, 'pj_B': 137, 'pj_E': 138, 'r_I': 139,
'r_S': 140, 'r_B': 141, 'r_E': 142, 'rj_I': 143, 'rj_S': 144, 'rj_B':
145, 'rj_E': 146, 's_I': 147, 's_S': 148, 's_B': 149, 's_E': 150,
'sch_I': 151, 'sch_S': 152, 'sch_B': 153, 'sch_E': 154, 'sh_I': 155,
'sh_S': 156, 'sh_B': 157, 'sh_E': 158, 'sj_I': 159, 'sj_S': 160, 'sj_B':
161, 'sj_E': 162, 't_I': 163, 't_S': 164, 't_B': 165, 't_E': 166, 'tj_I':
167, 'tj_S': 168, 'tj_B': 169, 'tj_E': 170, 'u0_I': 171, 'u0_S': 172,
'u0_B': 173, 'u0_E': 174, 'u1_I': 175, 'u1_S': 176, 'u1_B': 177, 'u1_E':
178, 'v_I': 179, 'v_S': 180, 'v_B': 181, 'v_E': 182, 'vj_I': 183, 'vj_S':
184, 'vj_B': 185, 'vj_E': 186, 'y0_I': 187, 'y0_S': 188, 'y0_B': 189,
'y0_E': 190, 'y1_I': 191, 'y1_S': 192, 'y1_B': 193, 'y1_E': 194, 'z_I':
195, 'z_S': 196, 'z_B': 197, 'z_E': 198, 'zh_I': 199, 'zh_S': 200,
'zh_B': 201, 'zh_E': 202, 'zj_I': 203, 'zj_S': 204, 'zj_B': 205, 'zj_E':
206}

symbols = list(pmap.keys())


# Export all symbols:
#symbols = [_pad] + list(_punctuation) + list(_letters) + list(_letters_ipa)

# Special symbol ids
SPACE_ID = symbols.index(" ")
